# Created 2021-11-17 Wed 22:59
#+title: shed
- what -- A Self-hosted Development Environment
- status -- ALPHA
- version -- 0.0.1
- [[https://hg.rwest.io/shed][src]] <-
- [[https://docs.rwest.io/shed][docs]] <-

#+results: 
| name    | [[https://rwest.io/m#shed][shed]]                                                                                 |
| version | alpha-0.1                                                                                                         |
| vc      | [[https://hg.rwest.io/shed/rev/cff2de401302][cff2de401302]], [[https://github.com/richardwesthaver/shed][github]] |
| updated | 22 hours ago                                                                                                      |

* Commands
#+begin_src shell
  shc --help
#+end_src

#+results: 
#+begin_example
  shc 0.1.0-867fdd94c0ed

  ellis <ellis@rwest.io>

  shed multi-development tool

  USAGE:
      shc [OPTIONS] [SUBCOMMAND]

  OPTIONS:
      -?                       set the log level
      -c, --config <config>    override configuration values
      -h, --help               Print help information
      -V, --version            Print version information

  SUBCOMMANDS:
      build       build scripts
      clean       clean stuff up
      download    fetch resources
      edit        edit all the things
      help        Print this message or the help of the given subcommand(s)
      init        initialize the shed
      krypt       blackbox
      pack        create packages from file or directory
      pull        fetch resources
      push        commit changes to upstream
      serve       network services
      stash       local storage
      status      print basic info
      store       shared block storage
      unpack      unpack .z or .tz files
      x           do things with runtimes
#+end_example

